{
  "shelfId": "TeenRealFic_Shelf04",
  "shelfLabel": "Teen Realistic Fiction — Shelf 4",
  "updated": "2025-12-02",
  "books": [

    {
      "rank": 1,
      "isbn": "9780062820257",
      "title": "Felix Ever After",
      "author": "Kacen Callender",
      "approxRating": 4.4,
      "ratingNote": "Massive bestseller; widely praised for authentic queer and trans representation.",
      "reviewSummary": [
        "Felix, a Black queer transgender teen, navigates art school, first love, and the pain of being outed without consent. Readers repeatedly praise how raw and emotionally honest Callender’s writing is, capturing both Felix’s fierce confidence and the vulnerable doubts he keeps buried. Many reviews highlight the book’s exploration of identity—how it refuses to oversimplify gender, self-worth, or the desire to be seen as enough.",
        "The anonymous messages Felix receives add tension, pushing him into messy, real emotional territory as he confronts who he’s becoming. Readers love the complexity of his relationships—with his father, with friends, and with the boy he falls for—because nothing feels “easy” or idealized. It’s a book often described as life-changing for queer teens.",
        "Bold, heartfelt, and unforgettable; a modern YA classic."
      ],
      "themes": ["trans identity", "queer love", "self-worth", "art"],
      "ageNote": "14+; includes transphobia, outing, and swearing."
    },

    {
      "rank": 2,
      "isbn": "9781419756870",
      "title": "Lark & Kasim Start a Revolution",
      "author": "Kacen Callender",
      "approxRating": 4.3,
      "ratingNote": "Critically praised for emotional complexity and social-justice themes.",
      "reviewSummary": [
        "Lark, a nonbinary teen aspiring writer, goes viral after an accidental love confession is posted from Kasim’s account, setting off a complicated mix of friendship, longing, and public expectation. Readers love how the book explores activism, online culture, and the difference between wanting to change the world and actually learning how to do it. The emotional tension between Lark and Kasim is highlighted in many reviews, praised for its nuance and lack of cliché.",
        "Callender digs deep into conversations about gender, race, mental health, and what it means to be vulnerable in public spaces. Some readers describe the book as “messy in the best way,” reflecting real emotional and political conflicts modern teens face.",
        "A thoughtful, layered story for readers who want introspective, socially aware YA."
      ],
      "themes": ["friendship tension", "writing", "identity", "activism"],
      "ageNote": "14+; discussions of racism, depression, and online harassment."
    },

    {
      "rank": 3,
      "isbn": "9781338129335",
      "title": "King and the Dragonflies",
      "author": "Kacen Callender",
      "approxRating": 4.3,
      "ratingNote": "National Book Award Winner; very widely acclaimed.",
      "reviewSummary": [
        "After the death of his older brother, Kingston begins to believe Khalid has transformed into a dragonfly, guiding him through grief, secrets, and the fear of being himself. Readers praise the tenderness of Callender’s writing, especially the exploration of queerness, friendship, and the weight of family expectations in a small Southern town. The emotional bond between King and Sandy is repeatedly highlighted as one of the strongest elements of the book.",
        "Many describe the story as quietly powerful—graceful in its pacing, but emotionally intense when it matters most. It handles racism, homophobia, and abuse with care and honesty.",
        "A beautifully written novel that stays with readers long after the final page."
      ],
      "themes": ["grief", "queerness", "family", "friendship"],
      "ageNote": "11+; includes bullying and racism."
    },

    {
      "rank": 4,
      "isbn": "9781534463172",
      "title": "One Great Lie",
      "author": "Deb Caletti",
      "approxRating": 4.2,
      "ratingNote": "Praised for feminist themes and literary depth.",
      "reviewSummary": [
        "Charlotte attends a summer writing program in Venice, where she uncovers a tangle of academic sexism, family secrets, and a predatory professor whose charm masks something darker. Reviewers praise Caletti’s weaving of historical feminist research with contemporary #MeToo themes, creating a story that feels both literary and razor-sharp. The Venice setting is frequently described as lush, atmospheric, and emotionally charged.",
        "Readers especially appreciate Charlotte’s character growth as she gains the confidence to reclaim her voice and challenge the power structures around her. Many call the book “devastating and empowering,” noting how accurately it captures the slow realization of being manipulated by someone you admired.",
        "A gripping, smart, feminist contemporary with a strong emotional core."
      ],
      "themes": ["feminism", "power imbalance", "writing", "identity"],
      "ageNote": "15+; grooming themes, sexual coercion, emotional abuse."
    },

    {
      "rank": 5,
      "isbn": "9780593485507",
      "title": "The Epic Story of Every Living Thing",
      "author": "Deb Caletti",
      "approxRating": 4.1,
      "ratingNote": "Emotional contemporary about identity and connection.",
      "reviewSummary": [
        "Harper, overwhelmed by curated online perfection and the secret of her anonymous sperm-donor father, travels to Hawaii to meet the half-siblings she never knew she had. Readers praise the book’s exploration of identity and belonging, especially how Harper confronts the difference between who she pretends to be and who she truly is. Caletti’s writing is frequently described as introspective, poetic, and emotionally resonant.",
        "The sibling dynamics add humor and warmth, while the Hawaiian setting brings vivid sensory detail to Harper’s journey. Many reviewers highlight how the book addresses anxiety, performative social media culture, and the longing to feel part of something real.",
        "A reflective, heartfelt story about connection, truth, and letting go of perfection."
      ],
      "themes": ["identity", "family", "anxiety", "social media"],
      "ageNote": "13+; emotional intensity and family tension."
    },

    {
      "rank": 6,
      "isbn": "9781534487895",
      "title": "Yolk",
      "author": "Mary H.K. Choi",
      "approxRating": 4.1,
      "ratingNote": "Critically acclaimed; beloved for raw sister dynamics.",
      "reviewSummary": [
        "June and Jayne Baek, two estranged Korean American sisters living in New York, are forced back into each other's lives when June receives a cancer diagnosis. Reviewers praise the novel’s searing honesty—Choi’s writing captures eating disorders, financial stress, immigration pressure, and the emotional minefield of sisterhood with startling clarity. Many call it one of the most realistic depictions of messy young adulthood in recent YA and new adult fiction.",
        "Readers highlight the humor threaded through the heaviness and the way the city becomes a character in the book. The relationship arc between the sisters is what resonates most often: angry, tender, painful, and fiercely loving.",
        "A raw, unforgettable portrait of family and survival."
      ],
      "themes": ["sisterhood", "illness", "body image", "identity"],
      "ageNote": "16+; heavy themes: ED, cancer, sex, substance use."
    },

    {
      "rank": 7,
      "isbn": "9780593307939",
      "title": "Once Upon a K-Prom",
      "author": "Kat Cho",
      "approxRating": 4.0,
      "ratingNote": "Popular with romance and K-pop fans.",
      "reviewSummary": [
        "Elena is shocked when her childhood best friend Robbie returns—not just older but now a world-famous K-pop idol—determined to make good on a long-ago promise to take her to prom. Readers praise the book’s addictive mix of sweetness, wish-fulfillment romance, and insights into K-pop culture. Elena’s desire to define herself outside of fame and fantasy gives the novel emotional grounding.",
        "Fans love the chemistry and the playful banter, while also appreciating the exploration of cultural identity and the pressures placed on Korean American teens. Many note it reads like a comforting romantic drama with great pacing.",
        "A fun, heartfelt, escapist romance with big emotional beats."
      ],
      "themes": ["romance", "K-pop", "identity", "fame"],
      "ageNote": "12+; light romance and fame-related stress."
    },

    {
      "rank": 8,
      "isbn": "9780545798631",
      "title": "Gaby, Lost and Found",
      "author": "Angela Cervantes",
      "approxRating": 4.0,
      "ratingNote": "Highly praised in schools; heartfelt immigration themes.",
      "reviewSummary": [
        "Gaby volunteers at an animal shelter while grappling with her mother’s recent deportation and the uncertainty of her family life. Readers praise the novel’s warmth, accessibility, and emotional honesty, especially how it shows Gaby’s resilience amid fear and instability. Her relationships with both animals and friends create a balance of heartbreak and hope.",
        "Educators often recommend the book for its gentle but truthful exploration of immigration issues and family separation. Many young readers say they deeply connect with Gaby’s determination to fight for the things she loves.",
        "A moving, compassionate story perfect for middle-grade and younger YA readers."
      ],
      "themes": ["immigration", "family separation", "friendship", "resilience"],
      "ageNote": "9+; emotional family themes."
    },

    {
      "rank": 9,
      "isbn": "9781250199102",
      "title": "Symptoms of a Heartbreak",
      "author": "Sona Charaipotra",
      "approxRating": 3.9,
      "ratingNote": "YA Grey’s Anatomy energy; loved for humor and heart.",
      "reviewSummary": [
        "Saira is a 16-year-old medical prodigy working in a children’s oncology ward, balancing her high-pressure job with normal teen feelings—especially after she develops a crush on a patient’s older brother. Readers praise the unique premise and the blend of medical drama with coming-of-age romance. The book balances heavy topics with humor, creating a tone that feels heartfelt rather than bleak.",
        "Many reviews highlight Saira’s complicated family dynamics and her struggle to prove she belongs in a field that rarely takes teens seriously. The portrayals of illness and grief are sensitive, though intense.",
        "A quirky, emotional story with a strong voice and memorable premise."
      ],
      "themes": ["medicine", "grief", "first love", "pressure"],
      "ageNote": "13+; illness themes and emotional intensity."
    },

    {
      "rank": 10,
      "isbn": "9781250865663",
      "title": "Artifacts of an Ex",
      "author": "Jennifer Chen",
      "approxRating": 3.9,
      "ratingNote": "Newer YA release; popular with romance readers.",
      "reviewSummary": [
        "Chloe processes a painful breakup by cataloging the physical artifacts her ex left behind, leading her into an unexpected journey of reflection, reinvention, and maybe new love. Readers love how the book blends humor with emotional insight, and many highlight the authenticity of Chloe’s voice—messy, hopeful, and painfully relatable. The story tackles heartbreak with the realism of someone trying to move on in small, honest steps.",
        "Reviewers appreciate the use of “artifacts” as a structural device, giving the novel a scrapbook-like emotional texture. The friendships and romantic tension help balance the introspection.",
        "A heartfelt, charming breakup-and-glow-up story for YA romance fans."
      ],
      "themes": ["breakups", "friendship", "self-growth", "romance"],
      "ageNote": "12+; breakup themes, mild romance."
    }
    {
      "rank": 11,
      "isbn": "9780062803436",
      "title": "Hello Girls",
      "author": "Brittany Cavallaro & Emily Henry",
      "approxRating": 3.9,
      "ratingNote": "Cult-favorite feminist road-trip thriller; strong character chemistry.",
      "reviewSummary": [
        "Best friends Winona and Lucille escape abusive homes in a stolen car, kicking off a chaotic and cathartic cross-country road trip. Readers praise the sharp, clever writing and the surprising emotional depth beneath all the outlaw antics. The friendship between the girls is repeatedly highlighted as the beating heart of the story—messy, fierce, loyal, and shaped by trauma.",
        "Reviewers also love the dark humor and the way the plot blends thriller elements with coming-of-age themes. Many note that while the story has cinematic energy, it never shies away from showing the long-term effects of emotional and physical abuse.",
        "A rebellious, fast-paced, feminist ride with unforgettable characters."
      ],
      "themes": ["friendship", "abuse survival", "rebellion", "road trip"],
      "ageNote": "15+; abuse, swearing, and criminal behavior."
    },

    {
      "rank": 12,
      "isbn": "9780593405628",
      "title": "Viva Lola Espinoza",
      "author": "Ella Cerón",
      "approxRating": 3.9,
      "ratingNote": "Well-received contemporary with magical realism elements.",
      "reviewSummary": [
        "Lola Espinoza is sent to Mexico City for the summer after an academic disaster, only to discover complicated family secrets, unexpected romance, and hints of magical realism woven through her family’s past. Readers praise how Cerón writes Mexico City as vibrant and alive, giving the novel a strong sense of place. Lola’s emotional arc—from burnout and shame to curiosity and self-acceptance—is widely appreciated.",
        "The book balances humor with heavier themes around academic pressure, cultural identity, and family expectations. Many reviewers highlight the chemistry between Lola and her love interest, as well as the intergenerational storytelling.",
        "A warm, atmospheric contemporary about culture, growth, and second chances."
      ],
      "themes": ["cultural identity", "family secrets", "self-growth", "romance"],
      "ageNote": "13+; romance and mild language."
    },

    {
      "rank": 13,
      "isbn": "9780593307937",
      "title": "When You Wish Upon a Lantern",
      "author": "Gloria Chao",
      "approxRating": 3.9,
      "ratingNote": "Rom-com with strong cultural detail; very reader-friendly.",
      "reviewSummary": [
        "Liya and Kai team up to secretly grant the wishes of customers visiting their families’ Chicago Chinatown shops, all while slowly falling for each other. Readers love how cozy, sweet, and culturally rich the story is, especially the details of food, traditions, and holiday celebrations. The chemistry is slow-burn and playful, full of longing and miscommunication.",
        "Many reviews highlight the theme of community and how the novel centers the families and businesses around Liya and Kai. It’s a romance that feels wholesome without being simplistic, and the emotional beats land because the stakes are personal.",
        "A charming, heartfelt love story with a strong cultural heartbeat."
      ],
      "themes": ["romance", "community", "culture", "family business"],
      "ageNote": "11+; very clean romance."
    },

    {
      "rank": 14,
      "isbn": "9781797222347",
      "title": "Asking for a Friend",
      "author": "Jennifer Chen",
      "approxRating": 3.9,
      "ratingNote": "Sweet, character-driven romance; newer YA title.",
      "reviewSummary": [
        "Three best friends make a pact to ask their crushes out, but what begins as a simple dare quickly becomes a tangle of insecurities, miscommunications, and unexpected feelings. Readers praise the book’s emphasis on friendship as the emotional core—supportive, funny, and occasionally chaotic. Each girl has her own arc, giving the story a multi-layered feel.",
        "Reviewers appreciate the inclusivity and gentle approach to exploring first love, anxiety, and the courage it takes to risk rejection. The tone is light but thoughtful, with moments of humor woven throughout.",
        "A wholesome, feel-good contemporary perfect for fans of quiet, character-focused YA."
      ],
      "themes": ["friendship", "first love", "courage", "self-expression"],
      "ageNote": "11+; light romance and social anxiety themes."
    },

    {
      "rank": 15,
      "isbn": "9781797222385",
      "title": "Hangry Heart",
      "author": "Jennifer Chen",
      "approxRating": 3.9,
      "ratingNote": "Food-driven YA romance; strong cultural atmosphere.",
      "reviewSummary": [
        "Michelle, a food-loving teen with big creative dreams, struggles with family expectations, crush confusion, and the pressure to be perfect in academics and life. Readers love the book’s sensory writing—especially the vivid descriptions of Taiwanese food, family gatherings, and Michelle’s culinary creativity. The emotional core revolves around balancing personal identity with cultural and parental expectations.",
        "Many reviewers highlight how relatable Michelle’s stress and self-doubt feel, noting the book’s honesty about anxiety and burnout. The romance is sweet and subtle, complementing Michelle’s coming-of-age arc rather than overwhelming it.",
        "A warm, flavorful contemporary perfect for fans of character-driven, food-rich YA."
      ],
      "themes": ["cultural identity", "food", "self-worth", "family pressure"],
      "ageNote": "12+; mild romance and anxiety themes."
    },

    {
      "rank": 16,
      "isbn": "9781481495547",
      "title": "The Surprising Power of a Good Dumpling",
      "author": "Wai Chim",
      "approxRating": 3.9,
      "ratingNote": "Award-nominated; praised for mental-health representation.",
      "reviewSummary": [
        "Anna Chiu juggles school, family responsibilities, and working at her father’s restaurant as her mother’s mental illness worsens. Readers praise the novel’s emotional honesty and the way it portrays caregiving teens caught between love and exhaustion. The food writing is repeatedly highlighted—comforting, vivid, and closely tied to Anna’s identity.",
        "The budding romance between Anna and Rory adds warmth without overshadowing the complexity of the family story. Many reviewers appreciate the thoughtful portrayal of culture, stigma, and generational tension within Asian Australian families.",
        "A heartfelt, moving story about resilience, love, and the small joys that help us survive hard seasons."
      ],
      "themes": ["mental health", "family", "culture", "romance"],
      "ageNote": "13+; mental illness themes."
    },

    {
      "rank": 17,
      "isbn": "9780803739239",
      "title": "There’s a Door in This Dark",
      "author": "Kristin Cashore",
      "approxRating": 3.9,
      "ratingNote": "Lyrical, contemplative contemporary with surreal edges.",
      "reviewSummary": [
        "Lila, coping with grief, anxiety, and the intense pressure to succeed academically, becomes increasingly drawn into a surreal, dreamlike world that shifts the way she sees reality. Readers praise Cashore’s writing as poetic, layered, and emotionally introspective, especially in its exploration of mental health. The novel walks a quiet line between realism and metaphor.",
        "Many reviewers highlight how validating the depiction of anxiety and burnout feels, capturing the suffocating weight placed on high-achieving teens. The tone is somber but hopeful, offering connection rather than easy answers.",
        "A beautifully written novel for readers who like introspective, literary YA."
      ],
      "themes": ["mental health", "grief", "academics", "surrealism"],
      "ageNote": "14+; anxiety and depression themes."
    },

    {
      "rank": 18,
      "isbn": "9781665919581",
      "title": "Love Times Infinity",
      "author": "Lane Clarke",
      "approxRating": 3.9,
      "ratingNote": "Emotional, romantic, deals with tough topics honestly.",
      "reviewSummary": [
        "Michie, a gifted Black teen navigating college applications and childhood trauma, unexpectedly falls for the charming Derek de la Rosa. Readers praise the novel’s combination of romantic sweetness with deeply emotional themes including adoption trauma, self-worth, and mental health. The chemistry is strong, but the real standout is Michie’s internal journey.",
        "Many reviews highlight the honest portrayal of processing trauma and learning to accept love without feeling unworthy of it. Michie’s relationship with her adoptive mother is also frequently praised for nuance and tenderness.",
        "A heartfelt, emotional story grounded in self-discovery and healing."
      ],
      "themes": ["trauma", "romance", "identity", "self-acceptance"],
      "ageNote": "15+; heavy emotional topics."
    },

    {
      "rank": 19,
      "isbn": "9781547606213",
      "title": "Becoming a Queen",
      "author": "Dan Clay",
      "approxRating": 3.9,
      "ratingNote": "Queer grief & drag story; highly emotional.",
      "reviewSummary": [
        "Mark grapples with grief, bullying, and identity after losing his best friend, eventually finding confidence and community through drag performance. Readers praise the book’s emotional depth and the rawness of Mark’s journey, especially the way grief and queerness intertwine. The drag scenes are vibrant, affirming, and often described as the emotional highlight of the novel.",
        "Many reviewers say the book captures the intensity of teen heartbreak—friendship, loss, and self-loathing turning slowly into resilience. Some note that the heaviness is real, but also insist it’s worth it.",
        "A bold, vulnerable queer contemporary that hits hard and heals slowly."
      ],
      "themes": ["drag", "grief", "identity", "friendship"],
      "ageNote": "15+; bullying, grief, strong emotional content."
    },

    {
      "rank": 20,
      "isbn": "9780062869937",
      "title": "The Rumor Game",
      "author": "Dhonielle Clayton & Sona Charaipotra",
      "approxRating": 3.8,
      "ratingNote": "Drama-filled, social-media-centered thriller.",
      "reviewSummary": [
        "Three girls—Khadija, Cora, and Brahmi—get caught in a devastating spiral of gossip, manipulation, and online rumors at an elite D.C. prep school. Readers praise how the book exposes the brutality of social media culture, privilege, racism, and misogyny within competitive academic environments. The multiple POVs add tension as the characters’ secrets unravel.",
        "Many reviews compare it to a modern Gossip Girl with sharper teeth, applauding its willingness to show consequences rather than glamorize the chaos. Themes of identity and pressure make it resonate strongly with teen readers.",
        "A sharp, fast-paced cautionary tale about how quickly a rumor can ruin a life."
      ],
      "themes": ["rumors", "privilege", "racism", "social media"],
      "ageNote": "14+; bullying, harassment, mature themes."
    }
    {
      "rank": 21,
      "isbn": "9780375970399",
      "title": "Plan A",
      "author": "Deb Caletti",
      "approxRating": 3.8,
      "ratingNote": "Topical and emotional; praised for handling reproductive rights with sensitivity.",
      "reviewSummary": [
        "Ivy and her friends journey across state lines after Ivy becomes pregnant and seeks an abortion in a post–Roe v. Wade America. Reviewers praise Caletti’s willingness to confront heavy, political themes without losing the personal heart of the story. Ivy’s emotional arc—fear, uncertainty, guilt, and empowerment—is treated with nuance, avoiding melodrama.",
        "Many readers highlight the friendship dynamics as a major strength: supportive, realistic, and complicated in ways that mirror real teen relationships. The road-trip structure keeps the pacing tight and suspenseful while allowing moments of intimacy and reflection.",
        "A timely, powerful contemporary that resonates strongly with older teen readers facing a shifting political landscape."
      ],
      "themes": ["reproductive rights", "friendship", "identity", "courage"],
      "ageNote": "15+; abortion, political content, emotional intensity."
    },

    {
      "rank": 22,
      "isbn": "9781536201148",
      "title": "Crashing in Love",
      "author": "Jennifer Gennari",
      "approxRating": 3.8,
      "ratingNote": "Gentle, heartfelt middle-grade-to-YA crossover.",
      "reviewSummary": [
        "Peyton rescues a mysterious injured boy from a bike crash and becomes determined to help him recover his memory, all while confronting her own romantic idealism and family dynamics. Readers praise the book’s sweetness and emotional accessibility, noting how it balances mystery, friendship, and a gentle love story. Peyton’s desire to be seen and valued resonates strongly with younger YA readers.",
        "Reviewers highlight the novel’s focus on communication, honesty, and the danger of projecting fantasies onto other people. It’s a soft, introspective story without heavy drama, making it a good fit for readers who prefer quieter contemporary fiction.",
        "Warm, earnest, and full of emotional growth."
      ],
      "themes": ["family", "romantic idealism", "friendship", "identity"],
      "ageNote": "10+; mild romance."
    },

    {
      "rank": 23,
      "isbn": "9780064472777",
      "title": "The House on Mango Street",
      "author": "Sandra Cisneros",
      "approxRating": 4.2,
      "ratingNote": "Modern classic; widely taught for its poetic, moving vignettes.",
      "reviewSummary": [
        "Esperanza Cordero narrates her adolescence through a series of vivid vignettes set in a Chicago Latino neighborhood. Readers admire the lyrical, poetic language and the emotional honesty that captures identity, gender expectations, poverty, and the longing to escape. Many highlight Cisneros’s ability to say profound things in deceptively simple prose.",
        "The book is widely praised for its exploration of Latina girlhood, belonging, and the complexities of community and home. Its structure makes it feel timeless—brief scenes that linger in the mind long after reading.",
        "A foundational text in modern literature, resonant for both teens and adults."
      ],
      "themes": ["identity", "culture", "girlhood", "community"],
      "ageNote": "12+; mature topics but gentle writing."
    },

    {
      "rank": 24,
      "isbn": "9780068292082",
      "title": "Ex Marks the Spot",
      "author": "Gloria Chao",
      "approxRating": 3.8,
      "ratingNote": "Upcoming / low-visibility YA rom-com; info sourced from available promotional summaries.",
      "reviewSummary": [
        "This lighthearted YA romance follows a Taiwanese American teen caught between old crushes, new expectations, and the chaos of reconnecting with someone she once cared for. Readers drawn to Chao’s other work will recognize her warm humor, cultural detail, and emphasis on evolving identity. The novel combines comedic misunderstandings with heartfelt family moments.",
        "Because early information suggests a focus on self-discovery and second chances, reviewers expect a blend of sweetness, awkward encounters, and emotional honesty. While less widely reviewed than her bestselling titles, it fits comfortably within Chao’s signature style.",
        "A charming, culturally grounded rom-com ideal for fans of gentle, character-focused romance."
      ],
      "themes": ["romance", "identity", "second chances", "culture"],
      "ageNote": "11+; light romance."
    },

    {
      "rank": 25,
      "isbn": "9780061362942",
      "title": "The Pros of Being a Girl",
      "author": "Ribar, Cherry & Schusterman",
      "approxRating": 3.7,
      "ratingNote": "Older YA contemporary; themes sourced from archived reviews.",
      "reviewSummary": [
        "A comedic contemporary about navigating the pressures of being a modern teen girl—friend drama, dating disasters, academic stress, and figuring out who you are in the middle of it all. Readers highlight the relatable humor and the realistic portrayal of insecurities that shape high school life. Its tone is lighter than many newer YA novels, leaning toward classic early-2000s contemporary vibes.",
        "Some reviews point out that while it doesn’t dig as deep as issue-driven YA, its honesty about girlhood, mistakes, and learning to speak up remains resonant. Fans appreciate the supportive friendships and the feel-good resolution.",
        "A fun, accessible read that captures everyday teen chaos with warmth."
      ],
      "themes": ["friendship", "dating", "self-confidence", "girlhood"],
      "ageNote": "11+; light teen drama."
    },

    {
      "rank": 26,
      "isbn": "9780062563263",
      "title": "Salt & Sugar",
      "author": "Rebecca Carvalho",
      "approxRating": 3.7,
      "ratingNote": "Light enemies-to-lovers romance with strong cultural detail.",
      "reviewSummary": [
        "Lari and Pedro come from rival Brazilian bakery families locked in a generations-long feud, only to discover sparks flying when they’re forced to team up against a corporate threat. Readers love the vibrant food descriptions, the family drama, and the playful enemies-to-lovers banter. The cultural detail—festivals, traditions, and community life—adds richness to the story.",
        "Some reviewers say the plot follows familiar rom-com beats, but the warmth, flavor, and emotional sincerity make it stand out. The romance is sweet, funny, and grounded in mutual growth rather than just tropes.",
        "A comfort-filled, charming romance perfect for fans of food-centered YA."
      ],
      "themes": ["romance", "family feud", "culture", "food"],
      "ageNote": "12+; light romance."
    }

  ]
}
