{
  "shelfId": "TeenRealFic_Shelf05",
  "shelfLabel": "Teen Realistic Fiction — Shelf 5",
  "updated": "2025-12-02",
  "books": [

    {
      "rank": 1,
      "isbn": "9781534462724",
      "title": "The Black Kids",
      "author": "Christina Hammonds Reed",
      "approxRating": 4.3,
      "ratingNote": "Critically acclaimed; powerful historical contemporary.",
      "reviewSummary": [
        "Set during the 1992 Los Angeles uprising, this novel follows Ashley Bennett, a wealthy Black teen whose sheltered world collapses as racial tension explodes around her. Readers praise how sharply Reed captures the fracture between Ashley’s privileged life and the violence happening blocks away, forcing her to examine identity, loyalty, and complicity. The dialogue feels painfully real, particularly the microaggressions and subtle racism within her friend group.",
        "Reviewers also highlight the complex family relationships, including Ashley’s strained connection to her sister and the pressures of a ‘respectable’ Black upbringing. Many say the book offers an essential perspective on race, history, and justice—one that feels both historical and frighteningly timely.",
        "A gripping, emotional coming-of-age story that resonates on multiple levels."
      ],
      "themes": ["race", "identity", "justice", "privilege"],
      "ageNote": "14+; racism, violence, and strong language."
    },

    {
      "rank": 2,
      "isbn": "9781534474192",
      "title": "Recommended for You",
      "author": "Laura Silverman",
      "approxRating": 4.2,
      "ratingNote": "Beloved rom-com; cozy and heartfelt.",
      "reviewSummary": [
        "Shoshanna works at a local indie bookstore and is determined to win a holiday sales bonus—until new hire Jake threatens her chances. Readers adore the enemies-to-lovers tension, the witty banter, and the warm bookstore atmosphere. The story blends lighthearted holiday vibes with real emotional stakes involving Shoshanna’s struggling relationship with her two moms and her fear of change.",
        "Reviewers say the book captures the feeling of being overwhelmed by both love and stress during the holidays, making the eventual romance feel earned and wholesome. It’s praised as sweet, fun, and perfect for fans of gentle contemporary romance.",
        "A cozy, uplifting rom-com with strong character charm."
      ],
      "themes": ["romance", "workplace rivalry", "family", "holidays"],
      "ageNote": "12+; light romance and mild conflict."
    },

    {
      "rank": 3,
      "isbn": "9780316098250",
      "title": "Spoiled",
      "author": "Heather Cocks & Jessica Morgan",
      "approxRating": 4.1,
      "ratingNote": "Sharp, funny, celebrity-culture satire.",
      "reviewSummary": [
        "When Molly Dix learns her absentee father is a major Hollywood star, she moves to L.A. and gets thrown into the world of tabloids, glamorous events, and her temperamental half-sister Brooke. Readers praise the book’s sharp humor and satirical take on celebrity culture, comparing it to Mean Girls with more emotional grounding. Brooke’s journey—from spoiled teen disaster to someone capable of vulnerability—is highlighted as a standout element.",
        "The story is fast, dramatic, and full of wild moments, but reviewers note that beneath the glitz is an unexpectedly heartfelt exploration of sisterhood and identity. A perfect pick for readers wanting escapism with emotional punch.",
        "Hilarious, dramatic, and surprisingly touching."
      ],
      "themes": ["celebrity life", "sisterhood", "identity", "family drama"],
      "ageNote": "13+; drama, partying, mild language."
    },

    {
      "rank": 4,
      "isbn": "9781368008396",
      "title": "My Almost Flawless Tokyo Dream Life",
      "author": "Rachel Cohn",
      "approxRating": 4.0,
      "ratingNote": "Fun, glamorous, YA escape-read set in Tokyo.",
      "reviewSummary": [
        "Elle Zoellner moves to Tokyo to live with her newly discovered billionaire father, and finds herself swept into a world of luxury, elite international schools, and culture shock. Readers love the vivid Tokyo setting—food, fashion, neighborhoods, and etiquette—which makes the story feel like an immersive escape. Elle’s emotional journey, balancing new privilege against her past instability, adds depth beneath the aspirational glitter.",
        "Many highlight the romance, friendships, and messy mistakes that make Elle feel real and relatable. The book is full of drama but also warmth, especially as Elle navigates family secrets and self-discovery.",
        "A glamorous, fast-paced contemporary perfect for fans of dramatic settings."
      ],
      "themes": ["culture", "family", "romance", "wealth"],
      "ageNote": "12+; light drama, mild language."
    },

    {
      "rank": 5,
      "isbn": "9780316349055",
      "title": "Finding Yvonne",
      "author": "Brandy Colbert",
      "approxRating": 4.0,
      "ratingNote": "Emotional, character-driven contemporary.",
      "reviewSummary": [
        "Yvonne, a talented violinist considering quitting her music career, becomes entangled in a love triangle and finds herself confronting adulthood more quickly than expected. Readers praise how Colbert portrays the confusing middle space between teen and adult decisions—dreams, relationships, and mistakes that carry real consequences. The writing is intimate and emotionally resonant, giving weight to Yvonne’s internal conflicts.",
        "The relationships—romantic, parental, and platonic—are layered and sometimes uncomfortable, which many reviewers appreciate for their realism. The book also dives into privilege, identity, and the pressure to live up to others’ expectations.",
        "A poignant, thoughtful story about choices, talent, and growing up."
      ],
      "themes": ["identity", "relationships", "future pressure", "music"],
      "ageNote": "14+; pregnancy themes, romance."
    },

    {
      "rank": 6,
      "isbn": "9781368053297",
      "title": "The Voting Booth",
      "author": "Brandy Colbert",
      "approxRating": 4.0,
      "ratingNote": "Fast-paced, socially conscious, one-day story.",
      "reviewSummary": [
        "Set over a single whirlwind day, this novel follows Marva and Duke—two Black teens fighting to secure their right to vote amid bureaucratic chaos. Readers love the urgency and relevance, praising how Colbert mixes activism, romance, and humor without feeling preachy. The chemistry between Marva and Duke is sweet and grounded, and their conversations highlight important political issues in accessible ways.",
        "Reviewers say the book captures the frustration many young voters experience, while also celebrating community and civic engagement. It’s both a love story and a rallying cry.",
        "Energetic, timely, and hopeful—perfect for teens newly entering civic life."
      ],
      "themes": ["activism", "voting rights", "romance", "social justice"],
      "ageNote": "12+; political tension and mild language."
    },

    {
      "rank": 7,
      "isbn": "9780593644669",
      "title": "Ariel Crashes a Train",
      "author": "Olivia A. Cole",
      "approxRating": 4.0,
      "ratingNote": "Intense, lyrical, boldly original.",
      "reviewSummary": [
        "Ariel survives a traumatic train crash, only to discover she cannot remember the exact events—and begins piecing together memories that reveal deeper emotional truths. Readers praise Cole’s poetic writing style and the haunting, surreal tone that blurs reality with trauma. Ariel’s voice is raw and introspective, exploring PTSD, identity, and what it means to rebuild after disaster.",
        "The book balances psychological intensity with moments of softness and connection, often praised for its emotional complexity. Reviewers note that it’s not a typical YA contemporary—more experimental and atmospheric.",
        "A gripping, haunting story about memory, survival, and self-reconstruction."
      ],
      "themes": ["trauma", "memory", "identity", "healing"],
      "ageNote": "14+; PTSD, emotionally heavy."
    },

    {
      "rank": 8,
      "isbn": "9781619633469",
      "title": "When Mr. Dog Bites",
      "author": "Brian Conaghan",
      "approxRating": 3.9,
      "ratingNote": "Gritty, funny, UK contemporary; sometimes polarizing.",
      "reviewSummary": [
        "Dylan Mint, a teen with Tourette syndrome, writes a bucket list after overhearing a doctor say he doesn’t have long to live. Readers praise the book’s humor and heart, especially how Dylan’s voice shines—unfiltered, chaotic, and vulnerable. The representation of Tourette’s is imperfect but emotionally rich, sparking both appreciation and debate.",
        "The story blends dark humor with emotional sincerity, offering both outrageous moments and scenes of genuine kindness. The characters around Dylan—his best friend, his mom, and his crush—are often highlighted for adding depth and grounding.",
        "A bold, unusual coming-of-age novel with a memorable narrator."
      ],
      "themes": ["Tourette syndrome", "friendship", "identity", "dark humor"],
      "ageNote": "14+; profanity, mature content."
    },

    {
      "rank": 9,
      "isbn": "9781335777096",
      "title": "Dear Haiti, Love Alaine",
      "author": "Maika & Maritza Moulite",
      "approxRating": 3.9,
      "ratingNote": "Lyrical, multi-format, culturally rich.",
      "reviewSummary": [
        "Alaine Beauparlant is sent to Haiti after a school incident, where she confronts her family’s complicated history, political intrigue, and generational trauma. Readers adore the multi-format storytelling—emails, transcripts, diary entries—which gives the book energy and personality. Haiti’s culture, landscapes, and political realities are woven throughout, adding power and depth.",
        "Many reviewers highlight the mother-daughter storyline as the emotional core, praising its honesty and nuance. The book balances humor with heavy themes, creating a vivid portrait of self-discovery and heritage.",
        "A vibrant, heartfelt story that blends culture, mystery, and identity."
      ],
      "themes": ["heritage", "family", "politics", "self-discovery"],
      "ageNote": "13+; political themes, emotional content."
    },

    {
      "rank": 10,
      "isbn": "9781423157229",
      "title": "Kill All Happies",
      "author": "Rachel Cohn",
      "approxRating": 3.8,
      "ratingNote": "Loud, chaotic, high-energy party novel.",
      "reviewSummary": [
        "On graduation night, Vic Navarro throws the biggest blowout party in town history before the local amusement park ‘Happies’ shuts down forever. Readers enjoy the wild, messy fun of the story, filled with crush drama, chaos, and emotional confessions in between. The book captures the feeling of one last reckless night before adulthood begins.",
        "Reviewers note that beneath the comedic energy is a surprisingly heartfelt exploration of friendship changes and the ache of leaving childhood behind. The humor is loud and unfiltered, which some love and others find chaotic.",
        "A fast, fun, high-drama ride perfect for fans of wild YA contemporaries."
      ],
      "themes": ["friendship", "chaos", "graduation", "coming-of-age"],
      "ageNote": "14+; drinking, partying, language."
    },

    {
      "rank": 11,
      "isbn": "9781335146496",
      "title": "Come On In: Stories About Immigration",
      "author": "Adi Alsaid (Editor)",
      "approxRating": 3.8,
      "ratingNote": "Anthology praised for emotional range and authenticity.",
      "reviewSummary": [
        "This anthology gathers twelve YA authors writing about immigration from diverse perspectives—documented and undocumented teens, cultural identity, belonging, and displacement. Readers praise the range of voices, writing styles, and emotional tones, noting that every story contributes something distinct. Some are heartbreaking, others hopeful or humorous, but all feel honest.",
        "Reviewers appreciate that the anthology avoids stereotypes, instead offering layered portrayals of teens navigating borders, bureaucracy, and family expectations. It’s used frequently in classrooms for its accessibility and impact.",
        "A powerful, varied collection that amplifies underrepresented voices beautifully."
      ],
      "themes": ["immigration", "identity", "culture", "family"],
      "ageNote": "12+; emotional themes."
    },

    {
      "rank": 12,
      "isbn": "9781728238223",
      "title": "Blame It on the Mistletoe",
      "author": "Beth Garrod",
      "approxRating": 3.8,
      "ratingNote": "Adorable, chaotic holiday romance.",
      "reviewSummary": [
        "Elle, an online influencer, swaps lives with Holly, a Christmas-obsessed British teen, leading to a holiday rom-com full of mishaps, crushes, and festive cheer. Readers praise the lighthearted tone, the dual perspectives, and the quirky humor that makes the story feel like a cozy holiday movie. The romance is sweet and clean, with friendship taking center stage.",
        "Reviewers highlight the contrast between the girls’ lives—glam vs cozy—and how both learn something important about themselves by seeing the world through the other’s eyes.",
        "A warm, feel-good read perfect for fans of holiday YA."
      ],
      "themes": ["friendship", "holidays", "identity", "romance"],
      "ageNote": "10+; very mild romance."
    },

    {
      "rank": 13,
      "isbn": "9781534497498",
      "title": "If I See You Again Tomorrow",
      "author": "Robbie Couch",
      "approxRating": 3.8,
      "ratingNote": "Heartfelt queer time-loop romance.",
      "reviewSummary": [
        "Clark is stuck living the same day on repeat until he meets Beau, a new boy who disrupts the cycle and leads him into an emotional adventure through memory, grief, and love. Readers praise Couch’s ability to blend humor, heart, and a high-concept premise into something deeply human. The time-loop structure lets the story explore loneliness and longing from fresh angles.",
        "The romance is tender and slow-building, with reviewers highlighting the vulnerability and kindness between the characters. Many say the book left them unexpectedly emotional.",
        "A sweet, thoughtful queer romance with sci-fi flair."
      ],
      "themes": ["time loop", "romance", "grief", "identity"],
      "ageNote": "13+; grief themes, mild language."
    },

    {
      "rank": 14,
      "isbn": "9781681192758",
      "title": "We Come Apart",
      "author": "Sarah Crossan & Brian Conaghan",
      "approxRating": 3.8,
      "ratingNote": "Verse novel praised for emotional intensity.",
      "reviewSummary": [
        "Jess and Nico meet during a teen restorative justice program and form a fragile connection that grows into something powerful. Written in verse, the novel explores racism, xenophobia, and trauma with sparse but impactful language. Readers praise the emotional weight carried in so few words.",
        "Many highlight the tragic arc of the story—unexpected, raw, and difficult to shake—calling it one of the most affecting verse novels in YA. The dual perspectives add nuance and urgency.",
        "A heartbreaking, beautifully written exploration of connection in dark circumstances."
      ],
      "themes": ["racism", "immigration", "love", "trauma"],
      "ageNote": "14+; heavy emotional content."
    },

    {
      "rank": 15,
      "isbn": "9780593425855",
      "title": "Does My Body Offend You?",
      "author": "Mayra Cuevas & Marie Marquardt",
      "approxRating": 3.8,
      "ratingNote": "Feminist, socially conscious contemporary.",
      "reviewSummary": [
        "After a dress code violation humiliates her, Malena joins forces with Ruby, a white feminist activist, and the two navigate privilege, racism, and the messy reality of standing up for yourself. Readers praise the dual POV format, which highlights the differences in their backgrounds without flattening either girl. The book dives into intersectionality, activism burnout, and the pressure to be ‘perfectly’ woke.",
        "Reviewers say the novel feels timely, honest, and full of important conversations, while still being character-driven and heartfelt.",
        "A thoughtful, engaging look at identity, protest, and allyship."
      ],
      "themes": ["feminism", "activism", "race", "identity"],
      "ageNote": "13+; social and political themes."
    },

    {
      "rank": 16,
      "isbn": "9780063157837",
      "title": "The Name She Gave Me",
      "author": "Betty Culley",
      "approxRating": 3.8,
      "ratingNote": "Verse novel with strong adoption themes.",
      "reviewSummary": [
        "Rynn, adopted at a young age, grapples with the pain of not knowing her birth family and begins searching for answers that shake her understanding of who she is. Readers highlight the quiet lyrical beauty of Culley’s writing, which handles trauma, belonging, and family secrets delicately. The verse format allows emotion to shine without overwhelming the reader.",
        "Many reviewers appreciate the nuanced portrayal of adoption—not sensationalized, but honest about grief, confusion, and longing. It’s gentle but deeply affecting.",
        "A tender, beautifully written story about identity and family roots."
      ],
      "themes": ["adoption", "identity", "family", "trauma"],
      "ageNote": "12+; emotional themes."
    },

    {
      "rank": 17,
      "isbn": "9781580898027",
      "title": "Running Full Tilt",
      "author": "Michael Currinder",
      "approxRating": 3.7,
      "ratingNote": "Underrated sports contemporary with emotional depth.",
      "reviewSummary": [
        "Leo starts running track as an escape from the chaos at home, especially the challenges of living with his autistic brother, Caleb. Readers praise how the book balances sibling love, resentment, guilt, and pride with sensitivity and honesty. The running scenes are vivid and energizing, reflecting Leo’s emotional journey.",
        "Reviewers note that the story doesn’t offer easy answers—it’s about living with complexity and finding space for yourself even when life feels overwhelming. Caleb is portrayed with nuance, avoiding stereotypes.",
        "A heartfelt, grounded story about family, sport, and self-discovery."
      ],
      "themes": ["family", "autism", "sports", "identity"],
      "ageNote": "12+; emotional stress and family conflict."
    },

    {
      "rank": 18,
      "isbn": "9780571339723",
      "title": "Take Three Girls",
      "author": "Cath Crowley, Simmone Howell & Fiona Wood",
      "approxRating": 3.7,
      "ratingNote": "Australian feminist contemporary with multi-POV depth.",
      "reviewSummary": [
        "Three girls—Clem, Kate, and Ady—form an unlikely friendship after being targeted by an anonymous toxic gossip blog at their elite Australian school. Readers praise the book’s exploration of girlhood, privilege, rumors, mental health, and the intense pressure to perform socially. The alternating perspectives create a vivid tapestry of personalities and struggles.",
        "Reviewers appreciate how the book handles feminism, sexuality, and body image with honesty and nuance. It’s messy, real, and reflective of modern teen life.",
        "Smart, heartfelt, and sharply observant—a powerful portrait of friendship."
      ],
      "themes": ["friendship", "rumors", "feminism", "mental health"],
      "ageNote": "14+; online harassment and mature themes."
    }

  ]
}
