{
  "shelfId": "TeenRealFic_Shelf07",
  "shelfLabel": "Teen Realistic Fiction — Shelf 7",
  "updated": "2025-12-03",
  "books": [

    {
      "rank": 1,
      "isbn": "9781984815408",
      "title": "The Passing Playbook",
      "author": "Isaac Fitzsimons",
      "approxRating": 4.3,
      "ratingNote": "Widely praised for joyful trans representation; one of the most loved YA sports contemporaries.",
      "reviewSummary": [
        "Spencer, a trans teen trying to blend in at a new school, reluctantly joins the soccer team—but when a discriminatory rule threatens his ability to play, he must choose between staying stealth and standing up for himself. Reviewers praise the book’s warmth and optimism, describing it as a much-needed alternative to trauma-centered trans narratives. Spencer’s romance with sweet, nerdy justice-focused teammate Justice is celebrated for its sincerity and softness.",
        "Readers love the balance of sports, identity, humor, and activism. The book handles big topics—passing, religion, institutional discrimination—without losing its hopeful tone. Many reviewers call it ‘a comfort read’ that shows queer joy, friendship, and resilience.",
        "A heartfelt, affirming story perfect for readers who want both depth and warmth."
      ],
      "themes": ["trans identity", "sports", "activism", "friendship", "romance"],
      "ageNote": "12+; gentle exploration of trans issues, mild romantic content."
    },

    {
      "rank": 2,
      "isbn": "9780553538687",
      "title": "No One Here Is Lonely",
      "author": "Sarah Everett",
      "approxRating": 4.2,
      "ratingNote": "Critically praised for emotional depth and speculative realism.",
      "reviewSummary": [
        "After Eden’s best friend and longtime crush dies unexpectedly, she learns his parents created a digital simulation of him—an AI chatbot built from his messages and memories. As Eden becomes dependent on the digital version of Will, the novel explores grief, technology, and the danger of clinging to what we’ve lost. Reviewers praise how the book blends realistic emotion with speculative elements to ask hard questions about love and memory.",
        "Readers highlight Everett’s writing as intimate and deeply felt, with a nuanced portrayal of complicated friendships, guilt, and healing. Many say the book made them cry in the best way.",
        "A heartbreaking but hopeful look at grief in the age of technology."
      ],
      "themes": ["grief", "technology", "friendship", "healing"],
      "ageNote": "13+; emotional grief themes."
    },

    {
      "rank": 3,
      "isbn": "9780063088535",
      "title": "Some Mistakes Were Made",
      "author": "Kristin Dwyer",
      "approxRating": 4.1,
      "ratingNote": "Huge BookTok favorite; known for emotional, messy romance.",
      "reviewSummary": [
        "Ellis and Easton were inseparable until a disastrous night shattered their relationship. Now, after a year apart, Ellis returns home—and all their unresolved longing and heartbreak resurfaces. Readers praise the book’s emotionally saturated writing, calling it one of the most realistic portrayals of messy, complicated love in YA. The chemistry between Ellis and Easton is repeatedly described as ‘painfully good.’",
        "Many reviewers highlight the found-family element and the exploration of class differences, trauma, and the distance between who we were and who we become. The writing style—raw, poetic, and intensely emotional—is a standout feature.",
        "A devastating, addictive love story about forgiveness and self-worth."
      ],
      "themes": ["romance", "trauma", "family", "identity"],
      "ageNote": "14+; intense emotional themes, some alcohol references."
    },

    {
      "rank": 4,
      "isbn": "9780063088580",
      "title": "The Atlas of Us",
      "author": "Kristin Dwyer",
      "approxRating": 4.0,
      "ratingNote": "Newer release; early reviews strong, especially for emotional writing.",
      "reviewSummary": [
        "As Riley navigates grief, friendship fractures, and the aftermath of a life-altering loss, she embarks on a cross-country journey to uncover emotional truths she’s avoided. Readers praise Dwyer’s lyrical writing and ability to capture the tender, painful parts of growing up. The exploration of mental health, healing, and complicated love mirrors the emotional style of her debut.",
        "Many reviews highlight the immersive settings and the complicated, beautifully flawed characters. Fans of emotional contemporary fiction appreciate its honesty and depth.",
        "A raw, introspective story about rebuilding after heartbreak."
      ],
      "themes": ["grief", "friendship", "healing", "self-discovery"],
      "ageNote": "14+; grief, emotional heaviness."
    },

    {
      "rank": 5,
      "isbn": "9781250222794",
      "title": "Little Universes",
      "author": "Heather Demetrios",
      "approxRating": 4.0,
      "ratingNote": "Highly emotional sister story; praised for depth and realism.",
      "reviewSummary": [
        "Sisters Mae and Hannah must rebuild their lives after the sudden death of their parents, navigating grief, addiction, and the fragile bonds that hold families together. Reviewers praise the emotional honesty and the vivid, poetic writing that captures the girls’ internal universes. The book dives deeply into depression, faith, science, and the different ways people cope with loss.",
        "Readers especially highlight how real the sister dynamic feels—love mixed with anger, guilt, and fierce protectiveness. It’s often described as a beautiful but heavy read.",
        "A powerful, heartbreaking contemporary for readers who want depth and emotional resonance."
      ],
      "themes": ["sisterhood", "grief", "addiction", "identity"],
      "ageNote": "15+; addiction, depression, emotional intensity."
    },

    {
      "rank": 6,
      "isbn": "9781665902373",
      "title": "Forget Me Not",
      "author": "Alyson Derrick",
      "approxRating": 4.0,
      "ratingNote": "Strong LGBTQ+ romance with emotional stakes.",
      "reviewSummary": [
        "Stevie suffers amnesia after a fall, forgetting her secret girlfriend Nora—and the entire life she built outside her conservative family’s expectations. Readers praise the emotional tension and the tenderness of Nora’s attempts to reconnect with Stevie without hurting her. The book explores identity, family pressure, and queer love with sensitivity and emotional realism.",
        "Many reviewers highlight the way the novel balances heartbreak with hope, creating a romance that feels grounded and deeply felt.",
        "A poignant, beautifully written story about rediscovering yourself and who you love."
      ],
      "themes": ["queer romance", "memory loss", "family", "identity"],
      "ageNote": "14+; emotional distress, homophobia themes."
    },

    {
      "rank": 7,
      "isbn": "9780525516255",
      "title": "Hot Dog Girl",
      "author": "Jennifer Dugan",
      "approxRating": 3.9,
      "ratingNote": "Popular queer rom-com; funny, awkward, heartfelt.",
      "reviewSummary": [
        "Lou, a lovable disaster bisexual, spends her last summer before senior year working at an amusement park—dressed as a giant hot dog—while chasing a crush, avoiding complicated feelings, and stumbling through friendship drama. Readers love the chaotic humor and Lou’s relatable, messy decision-making. The setting adds charm and nostalgia.",
        "Reviewers appreciate the queer representation and the exploration of self-discovery beneath all the comedy. It's lighthearted but still meaningful.",
        "A fun, sweet summer rom-com full of heart and humor."
      ],
      "themes": ["rom-com", "friendship drama", "identity", "summer jobs"],
      "ageNote": "12+; light romance, mild language."
    },

    {
      "rank": 8,
      "isbn": "9781534463172",
      "title": "The Miseducation of Cameron Post",
      "author": "Emily M. Danforth",
      "approxRating": 3.9,
      "ratingNote": "Award-winning queer coming-of-age story.",
      "reviewSummary": [
        "After Cameron is sent to a religious conversion camp following the death of her parents, she confronts guilt, identity, and the dangerous ideology of the institution meant to ‘fix’ her. Readers praise the novel’s depth, atmosphere, and emotional power. Danforth’s writing is often described as haunting and quietly devastating.",
        "The book explores queerness, trauma, rebellion, and survival with nuance and honesty. Readers appreciate its slow-burn pacing and richly drawn characters.",
        "A powerful modern queer classic."
      ],
      "themes": ["queer identity", "conversion therapy", "grief", "survival"],
      "ageNote": "15+; trauma, abuse themes."
    },

    {
      "rank": 9,
      "isbn": "9780063018570",
      "title": "When the Vibe Is Right",
      "author": "Sarah Dass",
      "approxRating": 3.8,
      "ratingNote": "Caribbean-set contemporary with romance and family themes.",
      "reviewSummary": [
        "Tess returns to Tobago to work on her family's cruise ship business, only to find herself clashing—and then bonding—with new hire and musician Brandon. Readers praise the tropical setting, the vivid cultural details, and the sweet slow-burn romance. Dass balances family pressure, grief, and ambition in a story that feels warm and atmospheric.",
        "Many reviewers highlight how immersive the setting is and how refreshing it is to see Caribbean YA romance.",
        "A fun, heartfelt novel with gorgeous island vibes."
      ],
      "themes": ["romance", "culture", "grief", "family"],
      "ageNote": "12+; mild romance and grief themes."
    },

    {
      "rank": 10,
      "isbn": "9780593429426",
      "title": "Love & Other Great Expectations",
      "author": "Becky Dean",
      "approxRating": 3.8,
      "ratingNote": "Romantic scavenger-hunt adventure set in the UK.",
      "reviewSummary": [
        "Britt retreats to England after an injury destroys her soccer career, joining a literary-themed scavenger hunt that introduces her to Luke, a charming bookish boy with secrets of his own. Readers praise the book’s cozy romance, literary references, and feel-good adventure elements. The travel setting adds charm and escapism.",
        "Many reviewers appreciate how Britt deals with personal disappointment and learns to redefine her identity outside of athletics.",
        "A sweet, uplifting contemporary perfect for fans of travel romance."
      ],
      "themes": ["romance", "travel", "self-discovery", "literature"],
      "ageNote": "12+; mild romance."
    },
    {
      "rank": 11,
      "isbn": "9781481459686",
      "title": "Truth or Dare",
      "author": "Barbara Dee",
      "approxRating": 3.8,
      "ratingNote": "Praised for nuanced middle-school-to-YA transition themes.",
      "reviewSummary": [
        "Lia is devastated when her best friend, Rachel, begins isolating herself and acting strangely—pulling away from their once inseparable bond. As the girls drift, Lia must navigate rumors, secrecy, and the fear of losing her closest connection. Readers praise the realistic portrayal of shifting friendships and the anxiety that loneliness brings.",
        "Dee handles emotional maturity, bodily changes, and early adolescent insecurity with her signature sensitivity and clarity. Many reviewers highlight how validating and relatable Lia’s experiences feel.",
        "A quiet, thoughtful novel about friendship changes and finding your footing during early adolescence."
      ],
      "themes": ["friendship changes", "puberty", "self-esteem", "rumors"],
      "ageNote": "10+; friendship tension, emotional challenges."
    },

    {
      "rank": 12,
      "isbn": "9781534405073",
      "title": "Everything I Know About You",
      "author": "Barbara Dee",
      "approxRating": 3.8,
      "ratingNote": "Known for strong mental-health awareness and school-story themes.",
      "reviewSummary": [
        "While on a school trip to Washington, D.C., Tally becomes increasingly worried about a classmate whose behavior suggests an eating disorder. Readers praise Dee for tackling tough mental-health topics with care while keeping the story accessible to younger teens. Tally’s growth as she learns how to support someone without overstepping feels authentic and empathetic.",
        "Reviewers also appreciate the humor and group dynamics of the class trip, which lighten the emotional weight. The book is often praised by educators for its gentle, responsible exploration of ED awareness.",
        "A compassionate, conversational story about noticing, helping, and growing up."
      ],
      "themes": ["mental health", "friendship", "body image", "school life"],
      "ageNote": "11+; eating disorder themes handled thoughtfully."
    },

    {
      "rank": 13,
      "isbn": "9781481478519",
      "title": "Halfway Normal",
      "author": "Barbara Dee",
      "approxRating": 3.8,
      "ratingNote": "Beloved for portraying life after cancer treatment with honesty.",
      "reviewSummary": [
        "After two years of leukemia treatment, Norah returns to middle school and must figure out how to be a ‘normal’ kid again—even though everything feels different. Readers praise the novel’s warm, empathetic tone and its sensitive portrayal of social reintegration after illness. Norah’s mix of frustration, hope, embarrassment, and determination resonates strongly.",
        "Many reviewers appreciate the supportive friendships and the gentle romance threads woven through the story. Dee offers a rare, uplifting perspective on survivorship rather than the illness itself.",
        "A heartfelt, hopeful story about healing and rediscovering joy."
      ],
      "themes": ["illness recovery", "friendship", "school transition", "identity"],
      "ageNote": "10+; illness discussion, recovery themes."
    },

    {
      "rank": 14,
      "isbn": "9781534438248",
      "title": "Don’t Ask Me Where I’m From",
      "author": "Jennifer De Leon",
      "approxRating": 3.8,
      "ratingNote": "Popular for immigration themes and nuanced identity exploration.",
      "reviewSummary": [
        "Liliana is selected for a school desegregation program that buses her from her working-class Latinx community to an affluent, mostly white school. As she navigates microaggressions, new friendships, and family instability—especially her father’s deportation—Liliana struggles to reconcile the different parts of her identity. Readers praise the sharp, honest voice and the cultural authenticity.",
        "De Leon’s blend of humor and seriousness keeps the book accessible even as it tackles difficult topics. Many reviewers highlight Liliana’s courage and her growth toward self-advocacy.",
        "A timely, heartfelt contemporary about belonging and speaking up."
      ],
      "themes": ["identity", "immigration", "school inequality", "family"],
      "ageNote": "12+; deportation themes, microaggressions."
    },

    {
      "rank": 15,
      "isbn": "9781665904162",
      "title": "Borderless",
      "author": "Jennifer De Leon",
      "approxRating": 3.8,
      "ratingNote": "Strong immigration drama with activism themes.",
      "reviewSummary": [
        "Maya, a talented teen fashion designer living in Guatemala City, is forced to confront gang violence, corruption, and the harsh realities of migrating north. Readers praise the book’s emotional intensity and authenticity, especially its portrayal of the dangers faced by Central American migrants. The story blends artistic passion with survival stakes in a powerful way.",
        "Many reviews highlight the balance between character development and social commentary. Maya’s journey feels deeply personal yet widely resonant.",
        "A gripping, socially conscious novel with real emotional weight."
      ],
      "themes": ["migration", "violence", "artistry", "survival"],
      "ageNote": "14+; violence, trauma, migration danger."
    },

    {
      "rank": 16,
      "isbn": "9781536204674",
      "title": "Made Glorious",
      "author": "Lindsay Eagar",
      "approxRating": 3.7,
      "ratingNote": "Moody, literary contemporary about ambition and identity.",
      "reviewSummary": [
        "After her parents’ divorce, Robie joins an intense, elite Shakespeare theater program where ambition, desire, and competition blur together. Readers praise Eagar’s atmospheric, emotionally complex writing, noting how the book explores performance—onstage and off—with sharp psychological insight. It blends coming-of-age realism with darkly theatrical flair.",
        "Reviewers highlight the intense friendships, the queer elements, and the questions the book raises about ambition and reinvention.",
        "A haunting, beautifully written contemporary with a literary edge."
      ],
      "themes": ["theater", "identity", "ambition", "performance"],
      "ageNote": "14+; mature emotional themes."
    },

    {
      "rank": 17,
      "isbn": "9781646035021",
      "title": "Possible Happiness",
      "author": "David Harris Ebenbach",
      "approxRating": 3.7,
      "ratingNote": "Small-press contemporary; thoughtful and introspective.",
      "reviewSummary": [
        "A quiet, reflective novel about a teen grappling with loneliness, self-worth, and the search for meaning amid life’s small disappointments. Readers describe the book as intimate and literary, with a protagonist who feels authentic in his awkwardness and longing. The writing leans contemplative rather than plot-driven.",
        "Reviewers appreciate the emotional subtlety and the focus on internal growth rather than dramatic highs and lows.",
        "A gentle, introspective contemporary for readers who like quieter stories."
      ],
      "themes": ["introspection", "loneliness", "identity", "growing up"],
      "ageNote": "12+; gentle emotional themes."
    },

    {
      "rank": 18,
      "isbn": "9781250847065",
      "title": "Tilly in Technicolor",
      "author": "Mazey Eddings",
      "approxRating": 3.7,
      "ratingNote": "Neurodivergent rom-com; praised for ADHD and autism rep.",
      "reviewSummary": [
        "Tilly, an autistic teen artist, and Oliver, an ADHD teen filmmaker, meet on an international work trip and instantly clash—before slowly discovering how well they fit together. Readers praise the neurodivergent representation as authentic, warm, and refreshing. The romance is sweet, equal parts awkward and supportive.",
        "Many reviewers love the travel setting and creative-professional backdrop, which add fun and emotional texture.",
        "A charming, inclusive romance with big heart and vibrant voice."
      ],
      "themes": ["neurodivergence", "romance", "travel", "art"],
      "ageNote": "12+; romance, mild language."
    },

    {
      "rank": 19,
      "isbn": "9780593381205",
      "title": "Bright Red Fruit",
      "author": "Safia Elhillo",
      "approxRating": 3.7,
      "ratingNote": "Verse novel exploring beauty culture and self-worth.",
      "reviewSummary": [
        "In this novel-in-verse, Nima becomes obsessed with a glamorous social-media star whose beauty tips begin to distort Nima’s sense of identity and worth. Readers praise Elhillo’s lyrical poetry and the honest portrayal of body image pressure, colorism, and cultural disconnection. The book is haunting and emotionally resonant.",
        "Many reviews compare its tone to Milk and Honey but more narrative-driven and grounded in teen experience.",
        "A powerful exploration of beauty, belonging, and vulnerability through poetry."
      ],
      "themes": ["body image", "social media", "identity", "colorism"],
      "ageNote": "13+; emotional distress, body-image themes."
    },

    {
      "rank": 20,
      "isbn": "9780374303754",
      "title": "Sad Perfect",
      "author": "Stephanie Elliot",
      "approxRating": 3.7,
      "ratingNote": "Unique second-person POV; focuses on ARFID eating disorder.",
      "reviewSummary": [
        "Told entirely in second person, ‘Sad Perfect’ follows Pea, a teen with ARFID (Avoidant/Restrictive Food Intake Disorder) as she navigates first love, mental-health challenges, and the limits of control. Reviewers praise the bold stylistic choice and the nuance in portraying an often misunderstood eating disorder. Pea’s voice feels raw and vulnerable.",
        "Many readers highlight how the romance offers comfort without magically solving Pea’s struggles, striking a realistic balance.",
        "A brave, emotionally rich portrayal of mental illness and vulnerability."
      ],
      "themes": ["eating disorders", "mental health", "first love", "identity"],
      "ageNote": "14+; mental illness themes, emotional distress."
    },    
    {
      "rank": 21,
      "isbn": "9781635830804",
      "title": "The Truth About Everything",
      "author": "Bridget Farr",
      "approxRating": 3.7,
      "ratingNote": "Quiet, thoughtful contemporary with survivalist themes.",
      "reviewSummary": [
        "Lark has been raised off-the-grid by her conspiracy-obsessed father, with homeschooling that centers on survival skills and mistrust of the outside world. But when she secretly enrolls in public school, she learns how much of the world she’s been missing—and how many truths have been kept from her. Reviewers praise the book’s nuanced depiction of controlling parental influence and the courage it takes to leave a belief system you were raised in.",
        "Readers highlight the blend of emotional tension, found friendships, and Lark’s slow awakening to her own values and desires.",
        "A compelling story about autonomy, truth, and reclaiming your life."
      ],
      "themes": ["control", "identity", "family", "freedom"],
      "ageNote": "12+; emotional manipulation themes."
    },

    {
      "rank": 22,
      "isbn": "9780374305956",
      "title": "The Prodigy",
      "author": "John Feinstein",
      "approxRating": 3.7,
      "ratingNote": "Popular sports YA; strong appeal for athletic readers.",
      "reviewSummary": [
        "Teen golf phenom Frank Baker enters the U.S. Open and must navigate fame, pressure, rivalries, and media scrutiny. Readers praise the sports authenticity—Feinstein’s background as a sports journalist shines through. The pacing is fast, the tournament scenes tense, and Frank’s character arc grounded in learning to trust himself.",
        "Reviewers appreciate that the book tackles exploitation in youth athletics and the pressures of competitive sports.",
        "A high-stakes, sports-driven contemporary perfect for athletic teen readers."
      ],
      "themes": ["sports", "pressure", "media", "competition"],
      "ageNote": "10+; intense sports themes."
    },

    {
      "rank": 23,
      "isbn": "9780374388454",
      "title": "Alondra",
      "author": "Gina Femia",
      "approxRating": 3.7,
      "ratingNote": "Theater-centered contemporary with queer themes.",
      "reviewSummary": [
        "Alondra joins a gritty Brooklyn community theater troupe and finds herself pulled into a whirlwind of creativity, found family, first love, and self-discovery. Readers praise Femia’s authentic portrayal of theater kids and the emotional rawness of Alondra’s journey. The queer elements are tender and deeply integrated into the story.",
        "Many reviews highlight the book’s sense of place and the way it captures the chaotic, beautiful energy of making art with people who care.",
        "A heartfelt, character-driven story about art, community, and finding your voice."
      ],
      "themes": ["theater", "queer identity", "found family", "self-expression"],
      "ageNote": "13+; romantic themes, emotional complexity."
    },

    {
      "rank": 24,
      "isbn": "9780063086210",
      "title": "Those Pink Mountain Nights",
      "author": "Jenny Ferguson",
      "approxRating": 3.6,
      "ratingNote": "Contemporary Indigenous YA with strong emotional themes.",
      "reviewSummary": [
        "Taejha, a Métis teen, wrestles with trauma, addiction recovery, and reconnection as she returns home and attempts to rebuild her life. Reviewers praise Ferguson’s poetic writing and her honest portrayal of cycles of harm and healing within marginalized communities. The story is heavy but full of heart.",
        "Readers appreciate how the book centers resilience, cultural identity, and imperfect but unconditional love.",
        "A powerful, introspective novel about healing, community, and survival."
      ],
      "themes": ["Indigenous identity", "healing", "trauma", "family"],
      "ageNote": "15+; addiction, trauma, heavy emotional content."
    },

    {
      "rank": 25,
      "isbn": "9780063086166",
      "title": "The Summer of Bitter and Sweet",
      "author": "Jenny Ferguson",
      "approxRating": 3.6,
      "ratingNote": "Award-winning Indigenous YA; intense but beautifully written.",
      "reviewSummary": [
        "Lou, a Métis teen, works at her family’s ice-cream shack over the summer while confronting family secrets, her complicated feelings about her father, her sexuality, and the weight of intergenerational trauma. Readers praise the emotional honesty, the cultural depth, and Lou’s sharp, compelling voice. The romance is gentle but meaningful.",
        "Reviewers highlight the balance between sweetness—community, cousins, ice cream—and the heavy themes Lou carries beneath the surface.",
        "A rich, emotionally layered story about identity, trauma, and love."
      ],
      "themes": ["Indigenous identity", "trauma", "family", "sexuality"],
      "ageNote": "15+; sexual assault backstory, trauma themes."
    },

    {
      "rank": 26,
      "isbn": "9780451480804",
      "title": "We Walked the Sky",
      "author": "Lisa Fiedler",
      "approxRating": 3.6,
      "ratingNote": "Mother-daughter dual-timeline circus story.",
      "reviewSummary": [
        "Told in alternating perspectives between Victoria, a teen runaway who joins a traveling circus in 1980, and her modern-day daughter Callie, the novel explores family legacy, grit, and belonging. Readers praise the rich circus atmosphere and the emotional contrast between the two timelines. Fans of unique settings find this especially appealing.",
        "Many reviewers highlight how the novel blends adventure with emotional introspection.",
        "A quirky and heartfelt novel about courage, reinvention, and family connection."
      ],
      "themes": ["circus life", "family", "identity", "legacy"],
      "ageNote": "12+; mild danger and emotional themes."
    },

    {
      "rank": 27,
      "isbn": "9780803739093",
      "title": "What I Thought Was True",
      "author": "Huntley Fitzpatrick",
      "approxRating": 3.6,
      "ratingNote": "Popular summer romance; emotional and atmospheric.",
      "reviewSummary": [
        "On a seaside island, Gwen tries to distance herself from a painful past while her ex-crush Cass takes a summer job working near her home. Reviewers praise the slow-burn romance, the emotional maturity, and the immersive summer setting. Fitzpatrick’s writing is known for warmth, charm, and complex characters.",
        "Readers especially appreciate the exploration of class differences and Gwen’s growth as she learns to forgive herself.",
        "A heartfelt summer contemporary about love, mistakes, and starting over."
      ],
      "themes": ["romance", "summer", "self-forgiveness", "class"],
      "ageNote": "13+; romantic situations, emotional topics."
    },

    {
      "rank": 28,
      "isbn": "9781538382848",
      "title": "Sanctuary Somewhere",
      "author": "Brenna Dimmig",
      "approxRating": 3.5,
      "ratingNote": "Newer, low-visibility contemporary; gentle and faith-adjacent themes.",
      "reviewSummary": [
        "A hopeful contemporary about finding belonging and safety—physical and emotional—when life feels unstable. Readers appreciate the soft tone, the themes of trust and rebuilding, and the focus on healing relationships. Limited reviews note that the book fits well for younger YA readers seeking gentle realism.",
        "The story blends small acts of kindness with slow personal growth, creating a warm emotional environment.",
        "A quiet, comforting contemporary about hope and stability."
      ],
      "themes": ["healing", "family", "belonging", "hope"],
      "ageNote": "10+; very gentle contemporary themes."
    }

  ]
}

